tap "caskroom/cask"
tap "homebrew/bundle"
tap "homebrew/cask"
tap "homebrew/cask-fonts"
tap "homebrew/cask-versions"
tap "homebrew/core"
tap "homebrew/services"

brew "bat"
brew "fish"
brew "go"
brew "hub"
brew "watchman"
brew "wget"
brew "yarn"
brew "zsh-autosuggestions"

cask "font-meslo-nerd-font"
cask "font-meslo-nerd-font-mono"
cask "react-native-debugger"
cask "tunnelblick"
cask "visual-studio-code"

mas "Bear", id: 1091189122
mas "Cardhop", id: 1290358394
mas "Drafts", id: 1435957248
mas "Fantastical", id: 975937182
mas "Spark", id: 1176895641
mas "Todoist", id: 585829637
mas "ToothFairy", id: 1191449274
mas "Xcode", id: 497799835
