tap "caskroom/cask"
tap "homebrew/bundle"
tap "homebrew/cask"
tap "homebrew/cask-fonts"
tap "homebrew/cask-versions"
tap "homebrew/core"
tap "homebrew/services"
tap "koekeishiya/formulae"
tap "valelint/vale"

# Clone of cat(1) with syntax highlighting and Git integration
brew "bat"
# Terminal multiplexer
brew "tmux"
# Load/unload environment variables based on $PWD
brew "direnv"
# User-friendly command-line shell for UNIX-like operating systems
brew "fish"
# Command-line fuzzy finder written in Go
brew "fzf"
# Graph visualization software from AT&T and Bell Labs
brew "graphviz"
# Add GitHub support to git on the command-line
brew "hub"
# Interpreted, interactive, object-oriented programming language
brew "python"
# Mac App Store command-line interface
brew "mas"
# Ambitious Vim-fork focused on extensibility and agility
brew "neovim"
# Search tool like grep and The Silver Searcher
brew "ripgrep"
# Display directories as trees (with optional color/HTML output)
brew "tree"
# Extraction utility for .zip compressed archives
brew "unzip"
# Internet file retriever
brew "wget"
# Tools for the WireGuard secure network tunnel
brew "wireguard-tools"
# Simple hotkey-daemon for macOS.
brew "koekeishiya/formulae/skhd"
# A tiling window manager for macOS based on binary space partitioning.
brew "koekeishiya/formulae/yabai"
# A customizable, syntax-aware linter for prose.
brew "valelint/vale/vale"

cask "font-fantasque-sans-mono"
cask "font-fantasquesansmono-nerd-font"
cask "font-fantasquesansmono-nerd-font-mono"
cask "font-firacode-nerd-font-mono"
cask "font-firamono-nerd-font"
cask "font-hack-nerd-font"
cask "visual-studio-code-insiders"

mas "1Password 7", id: 1333542190
mas "Bear", id: 1091189122
mas "Cardhop", id: 1290358394
mas "Day One", id: 1055511498
mas "Deliveries", id: 924726344
mas "Drafts", id: 1435957248
mas "Fantastical", id: 975937182
mas "MindNode", id: 1289197285
mas "Slack", id: 803453959
mas "Spark", id: 1176895641
mas "Todoist", id: 585829637
mas "WireGuard", id: 1451685025
